
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 4 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.applicationinsights-instrumentation-key
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_application_insights.appinsights


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights must be replaced
-/+ resource "azurerm_application_insights" "appinsights" {
      ~ app_id                                = "2ef778df-6b37-4801-a805-a249620ebe4e" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_in_gb                  = 100 -> (known after apply)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Insights/components/rd-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ location                              = "westeurope" -> "uksouth" # forces replacement
        name                                  = "rd-aat"
      ~ tags                                  = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#referencedata"
            "Team Name"           = "ReferenceData"
            "application"         = "referencedata"
          + "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
            "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ref-data-support"
          ~ "environment"         = "aat" -> "staging"
            "managedBy"           = "ReferenceData"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://rd-aat.vault.azure.net/secrets/app-insights-connection-string/0a2b6ff53f734ad282aa176de06fb96a"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.applicationinsights-instrumentation-key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "applicationinsights-instrumentation-key" {
        id                      = "https://rd-aat.vault.azure.net/secrets/ApplicationInsightsInstrumentationKey/fe9bf6c8797c49c5a540d133ed5b5deb"
        name                    = "ApplicationInsightsInstrumentationKey"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"          = "No"
          - "Team Contact"        = "#referencedata"
          - "Team Name"           = "ReferenceData"
          - "application"         = "referencedata"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#ref-data-support"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-10-31T12:01:04Z"
          - "managedBy"           = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                           = "rd-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":187,"Program":"tfcmt","SHA1":"","Vars":{}} -->